# DesignOptionId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementDesignOptionFilter..::..DesignOptionId Property
ElementDesignOptionFilter Class See Also
---
The design option id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementId DesignOptionId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DesignOptionId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ DesignOptionId {
	ElementId^ get ();
}
```

# See Also
ElementDesignOptionFilter Class
Autodesk.Revit.DB Namespace